#include <stdio.h>

int main() {
    int n;

    printf("Введіть вік (натуральне число <= 100): ");
    scanf("%d", &n);

    if (n % 10 == 1 && n != 11) {
        printf("%d рік\n", n);//перевіряє, чи остання цифра числа n дорівнює 1 і чи число не дорівнює 11. Якщо ця умова виконується, використовується слово "рік".
    } else if (n % 10 >= 2 && n % 10 <= 4 && (n < 10 || n > 20)) {
        printf("%d роки\n", n);// перевіряє, чи остання цифра числа n знаходиться в діапазоні від 2 до 4 і чи число не знаходиться в діапазоні від 10 до 20 (крім числа 11). Якщо ця умова виконується, використовується слово "роки".
    } else {
        printf("%d років\n", n);//В інших випадках використовується слово "років".
    }

    return 0;
}